reference/microbit/microbit-v2-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-01 Sun 13:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on the micro:bit v2.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Docker image runner" />
</head>
<body>
<div id="content">
<h1 class="title">Notes on the micro:bit v2.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5b93a3f">1. Sizes</a></li>
<li><a href="#org6e168d3">2. Processor</a>
<ul>
<li><a href="#org6956bea">2.1. Memory</a></li>
<li><a href="#orgbc12280">2.2. Reset</a></li>
</ul>
</li>
<li><a href="#orgf01f3df">3. System on a chip</a>
<ul>
<li><a href="#org14c997d">3.1. Memory</a></li>
<li><a href="#orgbc0c54b">3.2. Peripherals</a></li>
</ul>
</li>
<li><a href="#orgbd4b921">4. Microbit</a></li>
</ul>
</div>
</div>
<p>
These are JG's notes on the configuration of the v2 micro:bit.
</p>

<div id="outline-container-org5b93a3f" class="outline-2">
<h2 id="org5b93a3f"><span class="section-number-2">1</span> Sizes</h2>
<div class="outline-text-2" id="text-1">
<p>
2<sup>32</sup> bytes is 4 GiB.  
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Hexadecimal</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1 kiB</td>
<td class="org-left">2<sup>10</sup></td>
<td class="org-left">0x 0000 4000</td>
</tr>

<tr>
<td class="org-left">1 MiB</td>
<td class="org-left">2<sup>20</sup></td>
<td class="org-left">0x 0010 0000</td>
</tr>

<tr>
<td class="org-left">1 GiB</td>
<td class="org-left">2<sup>30</sup></td>
<td class="org-left">0x 4000 0000</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6e168d3" class="outline-2">
<h2 id="org6e168d3"><span class="section-number-2">2</span> Processor</h2>
<div class="outline-text-2" id="text-2">
<p>
The processor is an Arm Cortex M4F (the F means with floating-point
extensions). The architecture is ARMv7E-M. The floating-point
extensions are FPv4-SP. (SP stands for single precision.)
</p>

<p>
The M4 has several optional extensions. Some of these are available in
the version used in the nRF52833. The following options are
culled from the Arm docs and the Nordic docs (which don't seem
particularly terminologically consistent with each other).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Chosen by nRF52833</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Number of interrupts</td>
<td class="org-left">NVIC</td>
<td class="org-left">48</td>
</tr>

<tr>
<td class="org-left">Levels of interrupt priorities</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2<sup>3</sup></td>
</tr>

<tr>
<td class="org-left">SysTick timer</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Memory Protection Unit</td>
<td class="org-left">MPU</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Floating Point Unit</td>
<td class="org-left">FPU</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Instrument Trace Macrocell</td>
<td class="org-left">ITM</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Data Watchpoint and Trace</td>
<td class="org-left">DWT</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Embedded Trace Macrocell</td>
<td class="org-left">ETM</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Trace Port Interface Unit</td>
<td class="org-left">TPIU</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Debug Access Port</td>
<td class="org-left">DAP</td>
<td class="org-left">Yes</td>
</tr>

<tr>
<td class="org-left">Flash Patch and Breakpoint Unit</td>
<td class="org-left">FBP</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Bit-banding</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">Wake-up interrupt controller</td>
<td class="org-left">WIC</td>
<td class="org-left">No</td>
</tr>

<tr>
<td class="org-left">AHB Trace Macrocell</td>
<td class="org-left">HTM</td>
<td class="org-left">No</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Adv. High-Perf. Bus Access Port</td>
<td class="org-left">AHB-AP</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">Constant AHB control</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>

<p>
Source: Arm Cortex M4 Processor Datasheet; Arm Cortex M4 Generic User
Guide; Arm Cortex M4 Technical Reference Manual; nRF52833 Product Specification.
</p>
</div>

<div id="outline-container-org6956bea" class="outline-3">
<h3 id="org6956bea"><span class="section-number-3">2.1</span> Memory</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The following map of the available address space is in 0.5 GiB chunks.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">From</th>
<th scope="col" class="org-right">GiB</th>
<th scope="col" class="org-left">To</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0x E010 0000</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">0x FFFF FFFF</td>
<td class="org-left">511 MiB</td>
<td class="org-left">Vendor-specific memory</td>
</tr>

<tr>
<td class="org-left">0x E000 0000</td>
<td class="org-right">3.5</td>
<td class="org-left">0x E00F FFFF</td>
<td class="org-left">1 MiB</td>
<td class="org-left">Private peripheral bus</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">0x A000 0000</td>
<td class="org-right">2.5</td>
<td class="org-left">0x DFFF FFFF</td>
<td class="org-left">1.0 GiB</td>
<td class="org-left">External device</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">0x 6000 0000</td>
<td class="org-right">1.5</td>
<td class="org-left">0x 9FFF FFFF</td>
<td class="org-left">1.0 iGB</td>
<td class="org-left">External RAM</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">0x 4000 0000</td>
<td class="org-right">1.0</td>
<td class="org-left">0x 5FFF FFFF</td>
<td class="org-left">0.5 GiB</td>
<td class="org-left">Peripheral</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">0x 2000 0000</td>
<td class="org-right">0.5</td>
<td class="org-left">0x 3FFF FFFF</td>
<td class="org-left">0.5 GiB</td>
<td class="org-left">SRAM</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">0x 0000 0000</td>
<td class="org-right">0.0</td>
<td class="org-left">0x 1FFF FFFF</td>
<td class="org-left">0.5 GiB</td>
<td class="org-left">Code</td>
</tr>
</tbody>
</table>

<p>
The private peripheral bus memory starting at 0xE0000000 is for the
core peripheral registers (those in the CPU); the memory starting at
0x40000000 is for additional peripherals.
</p>
</div>
</div>

<div id="outline-container-orgbc12280" class="outline-3">
<h3 id="orgbc12280"><span class="section-number-3">2.2</span> Reset</h3>
<div class="outline-text-3" id="text-2-2">
<p>
On reset:
</p>

<ol class="org-ol">
<li>The main stack pointer (MSP) is loaded with the value in address 0x0;</li>

<li>The link register (LR) is set to 0xFFFFFFFF;</li>

<li>The program counter (PC) is set to the value of the reset vector,
which is at address 0x04.</li>

<li>Execution resumes, at the PC, in privileged Thread mode.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgf01f3df" class="outline-2">
<h2 id="orgf01f3df"><span class="section-number-2">3</span> System on a chip</h2>
<div class="outline-text-2" id="text-3">
<p>
The SoC is a Nordic Semiconductor nRF52833. 
</p>
</div>

<div id="outline-container-org14c997d" class="outline-3">
<h3 id="org14c997d"><span class="section-number-3">3.1</span> Memory</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The nRF52833 has 128 kB of RAM and 512 kB of Flash. 
</p>

<p>
The "code" section in the memory, from 0x0 to 0x1FFFFFFF, is assigned
as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">From</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">To</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">0x 1FFF FFFF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0x 1000 1000</td>
<td class="org-left">+ 4 kB</td>
<td class="org-left">?</td>
<td class="org-left">UICR</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0x 1000 0000</td>
<td class="org-left">256 MB</td>
<td class="org-left">?</td>
<td class="org-left">FICR</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0x 0080 0000</td>
<td class="org-left">8 MB</td>
<td class="org-left">0x 0082 0000</td>
<td class="org-left">128 kB</td>
<td class="org-left">Code RAM</td>
</tr>

<tr>
<td class="org-left">0x 0000 0000</td>
<td class="org-left">0</td>
<td class="org-left">0x 0008 0000</td>
<td class="org-left">512 kB</td>
<td class="org-left">Flash</td>
</tr>
</tbody>
</table>

<p>
FICR is the Factory Information Configuration Registers. There are
about 50 of these but they are not contiguous in this memory
region. UICR is the User Information Configuration Registers and are
non-volatile memory (which must be written in a special way like the
flash memory). They go up to about an offset of 0x308 from the
beginning and many are reserved.
</p>

<p>
The "SRAM" section contains a mapped version of the same RAM as in the
code section. That is, Code RAM and Data RAM are the same physical
memory:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">From</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">To</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">0x 3FFF FFFF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">0x 2000 0000</td>
<td class="org-left">0</td>
<td class="org-left">0x 2002 0000</td>
<td class="org-left">128 kB</td>
<td class="org-left">Data RAM</td>
</tr>
</tbody>
</table>

<p>
There are nRF52833 peripheral registers from 0x40000000 and also from
0x50000000.
</p>
</div>
</div>

<div id="outline-container-orgbc0c54b" class="outline-3">
<h3 id="orgbc0c54b"><span class="section-number-3">3.2</span> Peripherals</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Here is a brief list of the nRF52833 peripherals. A peripheral number
id is assigned 2<sup>10</sup> 32 bit registers starting at
0x40000000 + id x 0x1000 (except that apparently two peripherals may
share the same id). 
</p>

<p>
Peripherals receive "tasks" (from the PPI q.v., or from themselves, or
from events they generate). Peripherals generate events, and events
may trigger interrupts. The interrupt number (in the NVIC table)
triggered by a particular peripheralis the same as the peripheralid.
</p>

<p>
There's a thing called "Programmable Peripheral Interconnect" which
allows peripherals to talk to each other without CPU involvement. I
think this is what "tasks and events" are about.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">id</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">AAR</td>
<td class="org-left">0xF</td>
<td class="org-left">Accelerated address resolver</td>
<td class="org-left">For Bluetooth</td>
</tr>

<tr>
<td class="org-left">ACL</td>
<td class="org-left">0xE</td>
<td class="org-left">Access control lists</td>
<td class="org-left">Flash memory regions</td>
</tr>

<tr>
<td class="org-left">CCM</td>
<td class="org-left">0xF</td>
<td class="org-left">AES CCM encryption</td>
<td class="org-left">For Bluetooth</td>
</tr>

<tr>
<td class="org-left">COMP</td>
<td class="org-left">0x3</td>
<td class="org-left">Comparator</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ECB</td>
<td class="org-left">0xE</td>
<td class="org-left">Electronic Code Book</td>
<td class="org-left">For Bluetooth</td>
</tr>

<tr>
<td class="org-left">EGU</td>
<td class="org-left">0x4&#x2013;0x9</td>
<td class="org-left">Event Generator Unit(s)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GPIO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">General purpose IO</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">GPIOTE</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GPIO tasks and events</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">I2S</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Inter-IC sound interface</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LPCOMP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Low power comparator</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MWU</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Memory watch unit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">NFCT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Near-field communication tag</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PDM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Pulse density modulation</td>
<td class="org-left">For input</td>
</tr>

<tr>
<td class="org-left">PPI</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Programmable peripheral interconnect</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PWM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Pulse width modulation</td>
<td class="org-left">For output</td>
</tr>

<tr>
<td class="org-left">QDEC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Quadrature decoder</td>
<td class="org-left">For mechanical sensor input</td>
</tr>

<tr>
<td class="org-left">RADIO</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2.4 GHz radio</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RNG</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(True) random number generator</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RTC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Real-time counter</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SAADC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Analogue to digital converter</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SPI</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Serial peripheral interface</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">SWI</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Software interrupts</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TEMP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Temperature sensor</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TWI</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">I2C two-wire interface</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TIMER</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Timer / counter</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UART</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Universal async Rx/Tx</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">USBD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">USB device</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">WDT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Watchdog timer</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-orgbd4b921" class="outline-2">
<h2 id="orgbd4b921"><span class="section-number-2">4</span> Microbit</h2>
<div class="outline-text-2" id="text-4">
<p>
The microbit, in addition to the nRF52833, has an additional SoC (a
Cortex M0+ in v1, another M4 in v2) whose job is to manage the USB
connection. It presents the flash memory of the main processor as a
USB mass storage device, exposes the main processor's UART interface
over USB, and allows debugging.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Docker image runner</p>
<p class="date">Created: 2024-09-01 Sun 13:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
